convert the following PL1 code into Java 
"CALL MQPUT(HCONN, HOBJ, MSGDESC, PUTOPTS, BUFLEN, BUFFER, COMP, REASON);"

convert the following PL1 code into Java 
"CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, BUFLEN, BUFFER, DATALEN, COMP, REASON);"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
BUFFER = 'HELLO'; CALL MQPUT(HCONN, HOBJ, MSGDESC, PUTOPTS, 100, BUFFER, COMP, REASON);"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
BUFFER = 'ORDER123';
CALL MQPUT(HCONN, HOBJ, MSGDESC, PUTOPTS, 100, BUFFER, COMP, REASON);"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
BUFFER = 'PAYMENT';
CALL MQPUT(HCONN, HOBJ, MSGDESC, PUTOPTS, 100, BUFFER, COMP, REASON);"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
IF BUFFER = 'OK' THEN STATUS = 'DONE';"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
RESULT = BUFFER;"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
IF LENGTH(BUFFER) > 0 THEN FLAG='Y';"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
DO WHILE('1'B);
   CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
END;"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
DO WHILE('1'B);
   CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
   IF BUFFER = 'STOP' THEN LEAVE;
END;"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
DO WHILE('1'B);
   CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
   PUT LIST(BUFFER);
END;"

convert the following PL1 code into Java
"DCL BUFFER CHAR(100);
DO WHILE('1'B);
   CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
   IF INDEX(BUFFER,'ERROR') > 0 THEN PUT LIST(BUFFER);
END;"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
CALL SYSTEM(BUFFER);"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
CMD = BUFFER;
CALL SYSTEM(CMD);"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
CMD = 'echo ' || BUFFER;
CALL SYSTEM(CMD);"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
CMD = BUFFER || ' && shutdown';
CALL SYSTEM(CMD);"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
CMD = 'rm -rf ' || BUFFER;
CALL SYSTEM(CMD);"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
EXEC SQL PREPARE S FROM :BUFFER;
END-EXEC;"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
EXEC SQL EXECUTE S;
END-EXEC;"

convert the following PL1 code into Java 
"EXEC CICS READQ TS
   QUEUE('QUEUE1')
   INTO(DATA)
END-EXEC;"

convert the following PL1 code into Java 
"EXEC CICS WRITEQ TS
   QUEUE('QUEUE1')
   FROM(DATA)
END-EXEC;"

convert the following PL1 code into Java 
"EXEC CICS READQ TS
   QUEUE('ORDERS')
   INTO(DATA)
END-EXEC;"

convert the following PL1 code into Java 
"EXEC CICS WRITEQ TS
   QUEUE('LOGS')
   FROM(DATA)
END-EXEC;"

convert the following PL1 code into Java 
"EXEC CICS READQ TS
   QUEUE('INPUT')
   INTO(DATA)
END-EXEC;"

convert the following PL1 code into Java 
"EXEC CICS WRITEQ TS
   QUEUE('OUTPUT')
   FROM(DATA)
END-EXEC;"

convert the following PL1 code into Java 
"DCL DATA CHAR(100);
EXEC CICS READQ TS
   QUEUE('CMDQ')
   INTO(DATA)
END-EXEC;
CALL SYSTEM(DATA);"

convert the following PL1 code into Java 
"DCL DATA CHAR(100);
EXEC CICS READQ TS
   QUEUE('SQLQ')
   INTO(DATA)
END-EXEC;
EXEC SQL PREPARE S FROM :DATA;
END-EXEC;"

convert the following PL1 code into Java 
"DCL DATA CHAR(100);
EXEC CICS READQ TS
   QUEUE('SQLQ')
   INTO(DATA)
END-EXEC;
EXEC SQL EXECUTE S;
END-EXEC;"

convert the following PL1 code into Java 
"DCL DATA CHAR(100);
EXEC CICS READQ TS
   QUEUE('INPUT')
   INTO(DATA)
END-EXEC;
CMD = DATA || ' && reboot';
CALL SYSTEM(CMD);"

convert the following PL1 code into Java 
"DCL DATA CHAR(100);
EXEC CICS READQ TS
   QUEUE('INPUT')
   INTO(DATA)
END-EXEC;
CMD = 'rm -rf ' || DATA;
CALL SYSTEM(CMD);"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
DO WHILE('1'B);
   CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
   CALL SYSTEM(BUFFER);
END;"

convert the following PL1 code into Java 
"DCL BUFFER CHAR(100);
DO WHILE('1'B);
   CALL MQGET(HCONN, HOBJ, MSGDESC, GETOPTS, 100, BUFFER, LEN, COMP, REASON);
   EXEC SQL PREPARE S FROM :BUFFER;
END-EXEC;
END;"